package com.example.concurrent.localVariable;

/*
    Create by Atiye Mousavi 
    Date: 1/24/2022
    Time: 12:40 PM
**/
public class LocalAndLambda {
    public static void main(String[] args) {
//        Lambdas (و کلاس های داخلی ناشناس) را می توان در یک متد اعلان کرد و به متغیرهای محلی متد دسترسی داشت. با این حال، بدون هیچ محافظ اضافی، این می تواند منجر به مشکلات زیادی شود.
//
//قبل از JDK 8، یک قانون صریح وجود داشت که طبقات داخلی ناشناس فقط می توانند به متغیرهای محلی final دسترسی داشته باشند. JDK 8 مفهوم جدید به طور موثر final را معرفی کرد و قوانین کمتر سخت‌گیرانه شدند.
//نتیجه این قانون این است که فیلدهایی که در داخل لامبداها به آنها دسترسی پیدا می کند باید final یا به طور مؤثر final باشند (بنابراین تغییر نمی کنند) که آنها را به دلیل تغییر ناپذیری از نظر رشته ای ایمن می کند.
        String text="";
//         text = "675";
        new Thread(() ->System.out.println(text)).start();
    }
}
